tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "siderolabs/tap"
tap "warrensbox/tap"
brew "ansible"
brew "jpeg-xl"
brew "argocd-autopilot"
brew "autoconf"
brew "automake"
brew "node"
brew "aws-cdk"
brew "awscli"
brew "bat"
brew "glib"
brew "ccat"
brew "cdk"
brew "pango"
brew "chafa"
brew "checkov"
brew "cmatrix"
brew "coreutils"
brew "eksctl"
brew "eza"
brew "fd"
brew "ffind"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-secrets"
brew "gnu-sed"
brew "libksba"
brew "gnupg"
brew "go"
brew "libtool"
brew "graphviz"
brew "helm"
brew "imagemagick"
brew "ipython", link: false
brew "jq"
brew "k9s"
brew "kind"
brew "lazydocker"
brew "lazygit"
brew "mtr"
brew "neovim"
brew "oci-cli"
brew "openjdk"
brew "openssl@1.1"
brew "opentofu"
brew "pandoc"
brew "poppler"
brew "pdftoipe"
brew "pipx"
brew "pkgconf"
brew "plantuml"
brew "poetry", link: false
brew "postgresql@16"
brew "pre-commit"
brew "pyenv"
brew "python@3.11"
brew "python-gdbm@3.11"
brew "python-tk@3.11"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "sevenzip"
brew "stow"
brew "telnet"
brew "terraform-docs"
brew "terragrunt"
brew "tflint"
brew "tfsec"
brew "tlrc"
brew "tmux"
brew "toilet"
brew "tokei"
brew "tox"
brew "tree"
brew "trivy"
brew "viddy"
brew "wget"
brew "xclip"
brew "xh"
brew "xsel"
brew "yazi", args: ["HEAD"]
brew "zellij"
brew "zlib"
brew "zoxide"
brew "hashicorp/tap/terraform"
brew "siderolabs/tap/talosctl"
brew "warrensbox/tap/tfswitch"
cask "alacritty"
cask "alt-tab"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "glance"
cask "kitty"
cask "magiccap"
cask "orbstack"
cask "pgadmin4"
cask "postman"
cask "raycast"
cask "virtualbox"
cask "warp"
vscode "4ops.terraform"
vscode "aeschli.vscode-css-formatter"
vscode "alexcvzz.vscode-sqlite"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.theme-vitesse"
vscode "azemoh.one-monokai"
vscode "bceskavich.theme-dracula-at-night"
vscode "benjaminbenais.copilot-theme"
vscode "bierner.markdown-preview-github-styles"
vscode "boto3typed.boto3-ide"
vscode "donjayamanne.python-environment-manager"
vscode "dracula-theme.theme-dracula"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "esthorace.python-theme"
vscode "felipe-mendes.slack-theme"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "husseinkizz.duotone"
vscode "hyoretsu.code-spell-checker-language-pack"
vscode "johnpapa.vscode-peacock"
vscode "johnpapa.winteriscoming"
vscode "jprestidge.theme-material-theme"
vscode "kddejong.vscode-cfn-lint"
vscode "linhmtran168.mac-ca-vscode"
vscode "liviuschera.noctis"
vscode "meezilla.json"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.symbols"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "narasimapandiyan.jetbrainsmono"
vscode "natqe.reload"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "omthemes.omthemes"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "qwtel.sqlite-viewer"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "ryanluker.vscode-coverage-gutters"
vscode "sallar.vscode-duotone-dark"
vscode "sdras.night-owl"
vscode "seyyedkhandon.firacode"
vscode "seyyedkhandon.tpack"
vscode "shakram02.bash-beautify"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "solomonkinard.bookmark"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-catalan"
vscode "streetsidesoftware.code-spell-checker-croatian"
vscode "streetsidesoftware.code-spell-checker-czech"
vscode "streetsidesoftware.code-spell-checker-danish"
vscode "streetsidesoftware.code-spell-checker-dutch"
vscode "streetsidesoftware.code-spell-checker-french"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "streetsidesoftware.code-spell-checker-greek"
vscode "streetsidesoftware.code-spell-checker-hebrew"
vscode "streetsidesoftware.code-spell-checker-italian"
vscode "streetsidesoftware.code-spell-checker-medical-terms"
vscode "streetsidesoftware.code-spell-checker-persian"
vscode "streetsidesoftware.code-spell-checker-polish"
vscode "streetsidesoftware.code-spell-checker-portuguese-brazilian"
vscode "streetsidesoftware.code-spell-checker-russian"
vscode "streetsidesoftware.code-spell-checker-spanish"
vscode "streetsidesoftware.code-spell-checker-swedish"
vscode "streetsidesoftware.code-spell-checker-turkish"
vscode "streetsidesoftware.code-spell-checker-ukrainian"
vscode "streetsidesoftware.code-spell-checker-vietnamese"
vscode "suyashsonawane.vscode-datree"
vscode "tamasfe.even-better-toml"
vscode "tfsec.tfsec"
vscode "tommorris.mako"
vscode "uctakeoff.vscode-counter"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "whizkydee.material-palenight-theme"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zhuangtongfa.material-theme"
